### Starter code for Project 3. 
#### Run these cells before starting the assignment.

#### 1. create BQ dataset:

In [1]:
%env dataset_id=school_enrollments

env: dataset_id=school_enrollments

In [2]:
!bq --location=US mk --dataset $dataset_id

BigQuery error in mk operation: Dataset 'hip-waters-344506:school_enrollments'
already exists.

#### 2. create and populate BQ tables:

In [3]:
import os

In [4]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access-2/school-enrollments/*"
file_listings = os.popen(gsutil_cmd)
dataset="school_enrollments"

for file in file_listings:
    print(file)
    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ak.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ak.csv

Waiting on bqjob_r2d88a78a243b346d_0000018258707797_1 ... (2s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ar.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ar.csv

Waiting on bqjob_r4eb6d4ff16e7edb2_0000018258708a31_1 ... (7s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ca.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ca.csv

Waiting on bqjob_r5f8f4d53f9dfc232_000001825870b1de_1 ... (9s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_co.csv

skipping co
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ct.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ct.csv

Waiting on bqjob_r610d591de989be87_000001825870e1bb_1 ... (3s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_district.csv

skipping district
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_fl.csv

skipping fl
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ga.csv

skipping ga
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_hi.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access-2/school-enrollments/zf406jp4427_hi.csv

Waiting on bqjob_r7011cac8a5b11c02_000001825870f8fc_1 ... (2s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_id.csv

skipping id
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_la.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access-2/school-enrollments/zf406jp4427_la.csv

Waiting on bqjob_r32a0eac3dbf2a932_0000018258710b79_1 ... (4s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ma.csv

skipping ma
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_md.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access-2/school-enrollments/zf406jp4427_md.csv

Waiting on bqjob_r3d4fc0b93ef1b85b_00000182587125e1_1 ... (2s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_mn.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access-2/school-enrollments/zf406jp4427_mn.csv

Waiting on bqjob_r6dce14fdc6fc89aa_0000018258713886_1 ... (5s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_mo.csv

skipping mo
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ms.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ms.csv

Waiting on bqjob_r58a75ffef7fdc296_0000018258715779_1 ... (2s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ne.csv

skipping ne
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nh.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nh.csv

Waiting on bqjob_r10de16f74b50fd49_00000182587169a9_1 ... (2s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nv.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nv.csv

Waiting on bqjob_r1c9971e4147753dd_0000018258717bee_1 ... (2s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ny.csv

skipping ny
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ok.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ok.csv

Waiting on bqjob_r647581bb88cdcd4e_0000018258718e13_1 ... (4s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_or.csv

skipping or
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_pa.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_pa.csv

Waiting on bqjob_r3696722bf6259cce_000001825871a865_1 ... (4s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_sc.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access-2/school-enrollments/zf406jp4427_sc.csv

Waiting on bqjob_r7f98b2e8ce70d7a8_000001825871c342_1 ... (2s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_school.csv

skipping school
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_sd.csv

skipping sd
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_tx.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access-2/school-enrollments/zf406jp4427_tx.csv

Waiting on bqjob_ra889b87c9e59bbf_000001825871d531_1 ... (4s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wa.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wa.csv

Waiting on bqjob_r4606c6d752b66336_000001825871ef1f_1 ... (5s) Current status: DONE

gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wi.csv

skipping wi
gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wy.csv

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wy.csv

Waiting on bqjob_r53201ee6c1757889_0000018258720e4e_1 ... (1s) Current status: DONE

In [5]:
!bq ls

      datasetId
 --------------------
  college
  school_enrollments
  views

In [6]:
%%bigquery
SELECT table_name 
FROM school_enrollments.INFORMATION_SCHEMA.TABLES
ORDER BY table_name

Query complete after 0.01s: 100%|██████████| 2/2 [00:00<00:00, 1224.61query/s]
Downloading: 100%|██████████| 17/17 [00:01<00:00,  8.80rows/s]

   table_name
0          ak
1          ar
2          ca
3          ct
4          hi
5          la
6          md
7          mn
8          ms
9          nh
10         nv
11         ok
12         pa
13         sc
14         tx
15         wa
16         wy

#### 3. Find school enrollments by school name, grade level, and year for Texas

In [7]:
!bq show --schema=true $dataset_id.tx > tx_schema.txt

In [8]:
import json
f = open("tx_schema.txt")
lst = f.readlines()
f.close()
for i in json.loads(lst[0]):
    print(i['name'] + ' - ' + i['type'])

state - STRING
county - STRING
county_state_id - STRING
admin_level - STRING
district_nces_id - INTEGER
district_state_id - INTEGER
district_state_type - STRING
district - STRING
ccd_district_type - STRING
ccd_charter - STRING
ccd_district_lvl - STRING
ccd_district_low_grade - STRING
ccd_district_high_grade - STRING
school_nces_id - INTEGER
school_state_id - FLOAT
school - STRING
school_state_type - STRING
ccd_school_type - STRING
ccd_charter_school - BOOLEAN
ccd_school_lvl - STRING
ccd_school_low_grade - STRING
ccd_school_high_grade - STRING
year - INTEGER
term - STRING
grade - STRING
white - STRING
black - STRING
hispanic - STRING
native_american - STRING
native_american_alaskan_native - STRING
asian - STRING
native_hawaiian - STRING
asian_pacific_islander - STRING
native_hawaiian_pacific_islander - STRING
pacific_islander - STRING
multiracial - STRING
unknown_race - STRING
male - STRING
female - STRING
non_binary - STRING
unknown_gender - STRING
ell - STRING
ell_percent - STRING
homeless - STRING
homeless_percent - STRING
low_income - STRING
free_and_reduced - STRING
free_and_reduced_percent - STRING
disability - STRING
section_504 - STRING
total - STRING

#### Note: STRING type for "total" column

In [9]:
%%bigquery
select school, grade, year, 
sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1702.23query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 999.41rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020   2880
1     AKINS H S          grade_10  2021   2988
2     AKINS H S          grade_11  2020   2656
3     AKINS H S          grade_11  2021   2652
4     AKINS H S          grade_12  2020   2436
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    276
1735  ZILKER EL      kindergarten  2020    308
1736  ZILKER EL      kindergarten  2021    252
1737  ZILKER EL  pre_kindergarten  2020    120
1738  ZILKER EL  pre_kindergarten  2021     52

[1739 rows x 4 columns]

##### Documentation on BQ's string functions: https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [10]:
!bq --location=US mk --dataset "views"

BigQuery error in mk operation: Dataset 'hip-waters-344506:views' already
exists.

In [1]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, 
sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Executing query with job ID: 14d7d31c-a948-4231-bc88-731df1bdc39e
Query executing: 0.32s

ERROR:
 409 Already Exists: Table hip-waters-344506:views.austin_enrollments_by_school_grade_year

Location: US
Job ID: 14d7d31c-a948-4231-bc88-731df1bdc39e

In [12]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1784.81query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 968.28rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020   2880
1     AKINS H S          grade_10  2021   2988
2     AKINS H S          grade_11  2020   2656
3     AKINS H S          grade_11  2021   2652
4     AKINS H S          grade_12  2020   2436
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    276
1735  ZILKER EL      kindergarten  2020    308
1736  ZILKER EL      kindergarten  2021    252
1737  ZILKER EL  pre_kindergarten  2020    120
1738  ZILKER EL  pre_kindergarten  2021     52

[1739 rows x 4 columns]

#### 4. Open Data Studio and create a chart from this view:
##### https://datastudio.google.com/

#### Project 3

In [13]:
# all include md comment, GROUP BY, aggregate, ORDER BY
# 2 include UNION DISTINCT or UNION ALL - 1

##### 1 - 2021 enrollment counts for Texas counties with more than 1,000,000 students in descending order

In [14]:
%%bigquery
SELECT county, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
FROM school_enrollments.tx 
WHERE total != '' and year = 2021
GROUP BY county
HAVING total > 1000000
ORDER BY total DESC

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1917.25query/s]
Downloading: 100%|██████████| 9/9 [00:01<00:00,  4.79rows/s]

           county    total
0   HARRIS COUNTY  7033532
1   DALLAS COUNTY  3995420
2  TARRANT COUNTY  2782128
3    BEXAR COUNTY  2757376
4  HIDALGO COUNTY  2054616
5   COLLIN COUNTY  1791776
6   TRAVIS COUNTY  1511536
7  EL PASO COUNTY  1333936
8   DENTON COUNTY  1073556

##### 2 - 2021 enrollment counts for Texas by grade in descending order

In [15]:
%%bigquery
SELECT grade, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
FROM school_enrollments.tx
WHERE total != '' and year = 2021
GROUP BY grade
ORDER BY total DESC

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1719.21query/s]
Downloading: 100%|██████████| 15/15 [00:01<00:00,  8.25rows/s]

               grade    total
0            grade_9  3503772
1            grade_8  3388824
2           grade_10  3379044
3            grade_7  3378328
4            grade_6  3321080
5            grade_5  3170684
6           grade_11  3119664
7            grade_4  3088600
8            grade_1  3057516
9            grade_3  3055344
10           grade_2  3047512
11          grade_12  2928068
12      kindergarten  2899396
13  pre_kindergarten  1616740
14   early_education   231516

##### 3 - number of each type of entry in Texas enrollment data from 2021 in descending order

In [16]:
%%bigquery
SELECT admin_level, count(*) as total
FROM school_enrollments.tx
WHERE year = 2021
GROUP BY admin_level
ORDER BY total DESC

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2153.50query/s]
Downloading: 100%|██████████| 2/2 [00:01<00:00,  1.20rows/s]

  admin_level   total
0      school  234468
1    district   71192

##### 4 - number of entries for Texas counties with more than 10,000 entries in 2021 in descending order

In [17]:
%%bigquery
SELECT county, count(*) as total
FROM school_enrollments.tx
WHERE year = 2021
GROUP BY county
HAVING total > 10000
ORDER BY total DESC

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 2360.77query/s]
Downloading: 100%|██████████| 6/6 [00:01<00:00,  3.77rows/s]

           county  total
0   HARRIS COUNTY  30456
1   DALLAS COUNTY  23444
2    BEXAR COUNTY  17544
3  TARRANT COUNTY  15500
4  HIDALGO COUNTY  11836
5   TRAVIS COUNTY  10040

##### 5 - 2021 enrollment counts by school type for regular and alternative Texas schools in descending order

In [18]:
%%bigquery

SELECT ccd_school_lvl, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
FROM
(
SELECT *
FROM school_enrollments.tx
WHERE ccd_school_type = 'Regular School'
UNION ALL
SELECT *
FROM school_enrollments.tx
WHERE ccd_school_type = 'Alternative School'
)
WHERE year = 2021 and total != ''
GROUP BY ccd_school_lvl
ORDER BY total DESC

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1784.56query/s]
Downloading: 100%|██████████| 6/6 [00:01<00:00,  3.23rows/s]

    ccd_school_lvl    total
0       Elementary  9728288
1             High  6361080
2           Middle  4761032
3            Other   563740
4        Secondary   125396
5  Prekindergarten   123592

##### 6 - 2021 list of Texas counties with more than 100 K-12 schools in descending order

In [19]:
%%bigquery
SELECT county, count(*) as total
FROM school_enrollments.tx
WHERE total != '' and year = 2021 and ccd_school_low_grade = 'KG' and ccd_school_high_grade = '12'
GROUP BY county
HAVING total > 100
ORDER BY total DESC

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1891.60query/s]
Downloading: 100%|██████████| 9/9 [00:01<00:00,  4.70rows/s]

             county  total
0     DALLAS COUNTY    356
1     TAYLOR COUNTY    312
2      BEXAR COUNTY    204
3    TARRANT COUNTY    200
4  TOM GREEN COUNTY    156
5     HARRIS COUNTY    148
6       REAL COUNTY    104
7  WILBARGER COUNTY    104
8      SMITH COUNTY    104

##### 7 - 2021 enrollment counts for districts in Harris, Houston, and Galveston counties with more than 100,000 students in descending order

In [20]:
%%bigquery

SELECT district, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
FROM
(
SELECT *
FROM school_enrollments.tx
WHERE county like '%HOUSTON%'
UNION ALL
SELECT *
FROM school_enrollments.tx
WHERE county like '%GALVESTON%'
UNION ALL
SELECT *
FROM school_enrollments.tx
WHERE county like '%HARRIS%'
)
WHERE total != '' and year = 2021
GROUP BY district
HAVING total > 100000
ORDER BY total DESC

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1963.93query/s]
Downloading: 100%|██████████| 16/16 [00:01<00:00,  8.74rows/s]

                       district    total
0                   HOUSTON ISD  1580176
1         CYPRESS-FAIRBANKS ISD   920212
2                      KATY ISD   674184
3                    ALDINE ISD   506692
4                     KLEIN ISD   423192
5                  PASADENA ISD   406036
6                    HUMBLE ISD   365524
7                     ALIEF ISD   334312
8               CLEAR CREEK ISD   326852
9                    SPRING ISD   269980
10            SPRING BRANCH ISD   267624
11             GOOSE CREEK CISD   187040
12              GALENA PARK ISD   175948
13                  TOMBALL ISD   149808
14               HALLSVILLE ISD   122136
15  YES PREP PUBLIC SCHOOLS INC   107640

##### 8 - number of entries with more male than female students in Texas schools in 2021 in descending order

In [21]:
%%bigquery
SELECT cast(replace(replace(male, ",", ""), "<", "") as int64) / cast(replace(replace(female, ",", ""), "<", "") as int64) > 1 as more_males_than_females, count(*) as count
FROM school_enrollments.tx
WHERE male != '' and female != '' and year = 2021
GROUP BY more_males_than_females
ORDER BY count DESC

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1779.01query/s]
Downloading: 100%|██████████| 2/2 [00:01<00:00,  1.08rows/s]

   more_males_than_females  count
0                     True  27160
1                    False  12256

##### View no. 1 - 2021 enrollment counts for Texas by grade in descending order

In [4]:
%%bigquery
create view views.texas_enrollments_grade as
SELECT grade, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
FROM school_enrollments.tx
WHERE total != '' and year = 2021
GROUP BY grade
ORDER BY total DESC

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 827.12query/s]

Empty DataFrame
Columns: []
Index: []

In [5]:
%%bigquery
select * from views.texas_enrollments_grade

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1602.31query/s]
Downloading: 100%|██████████| 15/15 [00:01<00:00,  7.98rows/s]

               grade    total
0            grade_9  3503772
1            grade_8  3388824
2           grade_10  3379044
3            grade_7  3378328
4            grade_6  3321080
5            grade_5  3170684
6           grade_11  3119664
7            grade_4  3088600
8            grade_1  3057516
9            grade_3  3055344
10           grade_2  3047512
11          grade_12  2928068
12      kindergarten  2899396
13  pre_kindergarten  1616740
14   early_education   231516

##### View no. 2 - 2021 enrollment counts for Texas counties with more than 1,000,000 students in descending order

In [10]:
%%bigquery
create view views.texas_enrollments_county AS
SELECT county, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
FROM school_enrollments.tx 
WHERE total != '' and year = 2021
GROUP BY county
HAVING total > 1000000
ORDER BY total DESC

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1145.05query/s]

Empty DataFrame
Columns: []
Index: []

In [11]:
%%bigquery
select * from views.texas_enrollments_county

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1786.84query/s]
Downloading: 100%|██████████| 9/9 [00:02<00:00,  4.11rows/s]

           county    total
0   HARRIS COUNTY  7033532
1   DALLAS COUNTY  3995420
2  TARRANT COUNTY  2782128
3    BEXAR COUNTY  2757376
4  HIDALGO COUNTY  2054616
5   COLLIN COUNTY  1791776
6   TRAVIS COUNTY  1511536
7  EL PASO COUNTY  1333936
8   DENTON COUNTY  1073556